[abilitie.A_immu_Buff H7BaseBuff]
mName="雷电免疫"
mTooltip="此生物承受来自敌方魔法源攻击的伤害减少 %res。"

[abilitie.A_ImmunityAir_eagle H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="雷电鹰免疫"
mTooltip="该生物不能成为负面气系法术或效果的目标。来自敌方攻击的气系伤害减半。\n英雄军队中的生物承受所有魔法源的伤害减少 %buff.buff.res。"

[Creature.A_CreatureThunderBirds H7Creature]
mName="巨鹏"
mLore="众所周知，巨鹏会认真保护自己的领地，驱赶所有不速之客，因此其他动物本能地试图远离它们。唯一的例外是化为巨鹰形态的气之灵，它们在可怕的同类面前感到完全自在。这些鸟儿凭借强大的翅膀在天空中自由翱翔，更喜欢居住在岩石洞穴中，在强雷暴期间会从山上下来觅食。在狩猎过程中，它们以闪电般的速度急速俯冲，在毫无防备的猎物察觉到威胁之前就用利爪抓住它们。"

[Creature.A_CreatureThunderBirds_upr H7Creature]
mName="雷鸟"
mLore="随着成熟，一些云层猎手对气系元素的掌握提高到能够控制闪电的程度，成为迦楼罗。萨满将它们出现在兽人定居点上空视为天父的征兆，天父想亲眼见证部落是否配得上他的恩惠。迦楼罗时常与咆啸兽发生冲突，后者渴望以它们的蛋为食，而天空使者之间对抗的结果往往决定了酋长选择的道路——和平之路还是战争之路。"

版本 1.33

[abilitie.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="闪电闪烁"
mTooltip="该生物对目标和相邻生物造成 %d1 伤害。（每场战斗一次）"

版本 1.35

[abilitie.A_aura_foudre_eagle H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="闪电光环"
mTooltip="在回合结束时使相邻的敌方生物带电，带电生物在其回合开始时受到 %buff.buff.d %icon_Air 伤害，并且移动力减少 %buff.buff.stat %icon_movement。"

[abilitie.A_aura_foudre_Buff H7BaseBuff]
mName="带电"
mTooltip="该生物在其回合开始时受到 %d %icon_air 伤害，并获得 %stat %icon_movement 移动力。"